In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
from numpy import array

In [108]:
np.__file__

'/anaconda3/lib/python3.6/site-packages/numpy/__init__.py'

In [19]:
# df = pd.DataFrame(np.arange(16).reshape(8,2),columns=['月份','编号'])  
# df

# d = {'月份':pd.Series([201711, 201711, 201713], index=['a', 'b', 'c']), 
#      '编号':pd.Series([1122, 1123, 1124, 1125], index=['a', 'b', 'c', 'd'])}
# df = pd.DataFrame(d)
# df

# rng = pd.date_range('1/1/2011', periods=12, freq='D')
# ts = pd.Series(np.random.randn(len(rng)), index=rng)
# df = pd.DataFrame(ts,columns=['月份','编号'])  

data = [["2017-01",1153],
        ["2017-02",1154],
        ["2017-02",1163],
        ["2017-03",1173],
        ["2017-08",1253],
        ["2017-08",1253],
        ["2017-08",1253]]

In [20]:

df = DataFrame(data,  columns=["月份","编号"])
df

        月份    编号
0  2017-01  1153
1  2017-02  1154
2  2017-02  1163
3  2017-03  1173
4  2017-08  1253
5  2017-08  1253
6  2017-08  1253

In [21]:
df_1 = df.pivot(columns='月份')
df_1
#pivot_tables(df,index=['月份'],values='编号')
# df.set_index('月份', inplace=True)
# df

        编号
月份 2017-01 2017-02 2017-03 2017-08
0   1153.0     NaN     NaN     NaN
1      NaN  1154.0     NaN     NaN
2      NaN  1163.0     NaN     NaN
3      NaN     NaN  1173.0     NaN
4      NaN     NaN     NaN  1253.0
5      NaN     NaN     NaN  1253.0
6      NaN     NaN     NaN  1253.0

In [100]:
df.groupby('编号').sum()
df

           编号
月份
2017-01  1153
2017-02  1154
2017-02  1163
2017-03  1173
2017-08  1253

In [96]:
df.T

月份  2017-01  2017-02  2017-02  2017-03  2017-08
编号     1153     1154     1163     1173     1253

In [103]:
# df.pivot_table(index=['月份'],columns=['月份'],values='编号')#index=['id'],
frames = [df]
pd.concat(frames)

           编号
月份
2017-01  1153
2017-02  1154
2017-02  1163
2017-03  1173
2017-08  1253